FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVM/IAR/flash_loader NOR/src/LPC1788_pinConfig.h
/*---------------------------------------------------------------------------*
 *   This data created with Pins1788ToH v1.00 - Copyright Future Designs, Inc.
 *---------------------------------------------------------------------------*/



/*---------------------------------------------------------------------------*
 * Port 0 Configuration:
 *---------------------------------------------------------------------------*/
  /* ----- Pin P0[0 ]: UART3 ----- */
//LPC_IOCON->P0_0  |= 0; // GPIO
//LPC_IOCON->P0_0  |= 1; // CAN_RD1
  LPC_IOCON->P0_0  |= 2; // U3_TXD
//LPC_IOCON->P0_0  |= 3; // I2C1_SDA
//LPC_IOCON->P0_0  |= 4; // U0_TXD
//LPC_IOCON->P0_0  = (LPC_IOCON->P0_0  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_0                     0
  #define PINCLR_P0_0                     0
  #define PINDIR_P0_0                     0 // Input

  /* ----- Pin P0[1 ]: UART3 ----- */
//LPC_IOCON->P0_1  |= 0; // GPIO
//LPC_IOCON->P0_1  |= 1; // CAN1_TD
  LPC_IOCON->P0_1  |= 2; // U3_RXD
//LPC_IOCON->P0_1  |= 3; // I2C1_SCL
//LPC_IOCON->P0_1  |= 4; // U0_RXD
//LPC_IOCON->P0_1  = (LPC_IOCON->P0_1  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_1                     0
  #define PINCLR_P0_1                     0
  #define PINDIR_P0_1                     0 // Input

  /* ----- Pin P0[2 ]: ISP DEBUG ----- */ 
//LPC_IOCON->P0_2  |= 0; // GPIO
  LPC_IOCON->P0_2  |= 1; // U0_TXD
//LPC_IOCON->P0_2  |= 2; // U3_TXD
//LPC_IOCON->P0_2  = (LPC_IOCON->P0_2  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_2                     0
  #define PINCLR_P0_2                     0
  #define PINDIR_P0_2                     0 // Input

  /* ----- Pin P0[3 ]: ISP DEBUG ----- */ 
//LPC_IOCON->P0_3  |= 0; // GPIO
  LPC_IOCON->P0_3  |= 1; // U0_RXD
//LPC_IOCON->P0_3  |= 2; // U3_RXD
//LPC_IOCON->P0_3  = (LPC_IOCON->P0_3  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_3                     0
  #define PINCLR_P0_3                     0
  #define PINDIR_P0_3                     0 // Input

  /* ----- Pin P0[4 ]: GPIO ----- */
  LPC_IOCON->P0_4  |= 0; // GPIO
//LPC_IOCON->P0_4  |= 1; // I2S_RX_SCK
//LPC_IOCON->P0_4  |= 2; // CAN_RD2
//LPC_IOCON->P0_4  |= 3; // T2_CAP0
//LPC_IOCON->P0_4  |= 7; // LCD_VD0
//LPC_IOCON->P0_4  = (LPC_IOCON->P0_4  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_4                     0
  #define PINCLR_P0_4                     0
  #define PINDIR_P0_4                     0 // Input

  /* ----- Pin P0[5 ]: GPIO ----- */
  LPC_IOCON->P0_5  |= 0; // GPIO
//LPC_IOCON->P0_5  |= 1; // I2S_RX_WS
//LPC_IOCON->P0_5  |= 2; // CAN_TD2
//LPC_IOCON->P0_5  |= 3; // T2_CAP1
//LPC_IOCON->P0_5  |= 7; // LCD_VD1
//LPC_IOCON->P0_5  = (LPC_IOCON->P0_5  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_5                     0
  #define PINCLR_P0_5                     0
  #define PINDIR_P0_5                     0 // Input

  /* ----- Pin P0[6 ]: GPIO ----- */
  LPC_IOCON->P0_6  |= 0; // GPIO
//LPC_IOCON->P0_6  |= 1; // I2S_RX_SDA
//LPC_IOCON->P0_6  |= 2; // SSP1_SSEL1
//LPC_IOCON->P0_6  |= 3; // T2_MAT0
//LPC_IOCON->P0_6  |= 4; // U1_RTS
//LPC_IOCON->P0_6  |= 7; // LCD_VD8
//LPC_IOCON->P0_6  = (LPC_IOCON->P0_6  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_6                     0
  #define PINCLR_P0_6                     0
  #define PINDIR_P0_6                     0 // Input

  /* ----- Pin P0[7 ]: GPIO ----- */
//LPC_IOCON->P0_7  |= 0; // GPIO
  LPC_IOCON->P0_7  |= 1; // I2S_TX_SCK
//LPC_IOCON->P0_7  |= 2; // SSP1_SCK
//LPC_IOCON->P0_7  |= 3; // T2_MAT1
//LPC_IOCON->P0_7  |= 4; // RTC_EV0
//LPC_IOCON->P0_7  = (LPC_IOCON->P0_7  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_7                     0
  #define PINCLR_P0_7                     0
  #define PINDIR_P0_7                     0 // Input

  /* ----- Pin P0[8 ]: GPIO ----- */
  LPC_IOCON->P0_8  |= 0; // GPIO
//LPC_IOCON->P0_8  |= 1; // I2S_TX_WS
//LPC_IOCON->P0_8  |= 2; // SSP1_MISO
//LPC_IOCON->P0_8  |= 3; // T2_MAT2
//LPC_IOCON->P0_8  |= 4; // RTC_EV1
//LPC_IOCON->P0_8  |= 7; // LCD_VD16
//LPC_IOCON->P0_8  = (LPC_IOCON->P0_8  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_8                     0
  #define PINCLR_P0_8                     0
  #define PINDIR_P0_8                     0 // Input

  /* ----- Pin P0[9 ]: GPIO ----- */
  LPC_IOCON->P0_9  |= 0; // GPIO
//LPC_IOCON->P0_9  |= 1; // I2S_TX_SDA
//LPC_IOCON->P0_9  |= 2; // SSP1_MOSI
//LPC_IOCON->P0_9  |= 3; // T2_MAT3
//LPC_IOCON->P0_9  |= 4; // RTC_EV2
//LPC_IOCON->P0_9  |= 7; // LCD_VD17
//LPC_IOCON->P0_9  = (LPC_IOCON->P0_9  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_9                     0
  #define PINCLR_P0_9                     0
  #define PINDIR_P0_9                     0 // Input

  /* ----- Pin P0[10]: GPIO ----- */
  LPC_IOCON->P0_10 |= 0; // GPIO
//LPC_IOCON->P0_10 |= 1; // U2_TXD
//LPC_IOCON->P0_10 |= 2; // I2C2_SDA
//LPC_IOCON->P0_10 |= 3; // T3_MAT0
//LPC_IOCON->P0_10 = (LPC_IOCON->P0_10 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_10                    0
  #define PINCLR_P0_10                    0
  #define PINDIR_P0_10                    1 // Output

  /* ----- Pin P0[11]: EXP GPIO ----- */
  LPC_IOCON->P0_11 |= 0; // GPIO
//LPC_IOCON->P0_11 |= 1; // U2_RXD
//LPC_IOCON->P0_11 |= 2; // I2C2_SCL
//LPC_IOCON->P0_11 |= 3; // T3_MAT1
//LPC_IOCON->P0_11 = (LPC_IOCON->P0_11 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_11                    0
  #define PINCLR_P0_11                    0
  #define PINDIR_P0_11                    0 // Input

  /* ----- Pin P0[12]: ----- */ 
  LPC_IOCON->P0_12 |= 0; // GPIO
//LPC_IOCON->P0_12 |= 1; // USB_PPWR2n
//LPC_IOCON->P0_12 |= 2; // SSP1_MISO
//LPC_IOCON->P0_12 |= 3; // AD0_6
  LPC_IOCON->P0_12 = (LPC_IOCON->P0_12 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_12                    0
  #define PINCLR_P0_12                    0
  #define PINDIR_P0_12                    0 // Input

  /* ----- Pin P0[13]: ----- */ 
//LPC_IOCON->P0_13 |= 0; // GPIO
  LPC_IOCON->P0_13 |= 1; // USB_UP_LED2
//LPC_IOCON->P0_13 |= 2; // SSP1_MOSI
//LPC_IOCON->P0_13 |= 3; // AD0_7
//LPC_IOCON->P0_13 = (LPC_IOCON->P0_13 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_13                    0
  #define PINCLR_P0_13                    0
  #define PINDIR_P0_13                    0 // Input

  /* ----- Pin P0[14]: USB CONNECT2 ----- */
//LPC_IOCON->P0_14 |= 0; // GPIO
//LPC_IOCON->P0_14 |= 1; // USB_HSTEN2n
//LPC_IOCON->P0_14 |= 2; // SSP1_SSEL
  LPC_IOCON->P0_14 |= 3; // USB_CONNECT2
//LPC_IOCON->P0_14 = (LPC_IOCON->P0_14 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_14                    0
  #define PINCLR_P0_14                    0
  #define PINDIR_P0_14                    0 // Input

