FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVM/IAR/flash_loader NOR/src/LPC1788_pinConfig.h
  /* ----- Pin P0[15]: UART1_TX ----- */
//LPC_IOCON->P0_15 |= 0; // GPIO
  LPC_IOCON->P0_15 |= 1; // U1_TXD
//LPC_IOCON->P0_15 |= 2; // SSP0_SCK
#if HAVE_LOC_REGISTERS
  LPC_IOCON->LOC_SSP0_SCK = 2;
#endif
  //LPC_IOCON->P0_15 = (LPC_IOCON->P0_15 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P0_15                    0
  #define PINCLR_P0_15                    0
  #define PINDIR_P0_15                    0 // Input

  /* ----- Pin P0[16]: UART1_RX ----- */
//LPC_IOCON->P0_16 |= 0; // GPIO
  LPC_IOCON->P0_16 |= 1; // U1_RXD
//LPC_IOCON->P0_16 |= 2; // SSP0_SSEL
  LPC_IOCON->P0_16 = (LPC_IOCON->P0_16 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_16                    1
  #define PINCLR_P0_16                    0
  #define PINDIR_P0_16                    1 // Output

  /* ----- Pin P0[17]: UART1_CTS ----- */
//LPC_IOCON->P0_17 |= 0; // GPIO
  LPC_IOCON->P0_17 |= 1; // U1_CTS
//LPC_IOCON->P0_17 |= 2; // SSP0_MISO
#if HAVE_LOC_REGISTERS
      LPC_IOCON->LOC_SSP0_MISO = 2;
#endif
//LPC_IOCON->P0_17 = (LPC_IOCON->P0_17 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_17                    0
  #define PINCLR_P0_17                    0
  #define PINDIR_P0_17                    0 // Input

  /* ----- Pin P0[18]: Serial Flash CS ----- */
  LPC_IOCON->P0_18 |= 0; // GPIO
//LPC_IOCON->P0_18 |= 1; // U1_DCD
//LPC_IOCON->P0_18 |= 2; // SSP0_MOSI
#if HAVE_LOC_REGISTERS
    LPC_IOCON->LOC_SSP0_MOSI = 2;
#endif
  //LPC_IOCON->P0_18 = (LPC_IOCON->P0_18 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P0_18                    0
  #define PINCLR_P0_18                    0
  #define PINDIR_P0_18                    0 // Input

  /* ----- Pin P0[19]: EXP ----- */
  LPC_IOCON->P0_19 |= 0; // GPIO
//LPC_IOCON->P0_19 |= 1; // U1_DSR
//LPC_IOCON->P0_19 |= 2; // SD_CLK
//LPC_IOCON->P0_19 |= 3; // I2C1_SDA
//      LPC_IOCON->P0_19 = (LPC_IOCON->P0_19 & ~(3<<10)) | (1<<10);
#if HAVE_LOC_REGISTERS
      LPC_IOCON->LOC_I2C1_SDA = 2;
#endif
  //LPC_IOCON->P0_19 = (LPC_IOCON->P0_19 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P0_19                    0
  #define PINCLR_P0_19                    0
  #define PINDIR_P0_19                    0 // Input

  /* ----- Pin P0[20]: EXP ----- */
  LPC_IOCON->P0_20 |= 0; // GPIO
//LPC_IOCON->P0_20 |= 1; // U1_DTR
//LPC_IOCON->P0_20 |= 2; // SD_CMD
//LPC_IOCON->P0_20 |= 3; // I2C1_SCL
//    LPC_IOCON->P0_20 = (LPC_IOCON->P0_20 & ~(3<<10)) | (1<<10);
#if HAVE_LOC_REGISTERS
      LPC_IOCON->LOC_I2C1_SCL = 2;
#endif
  //LPC_IOCON->P0_20 = (LPC_IOCON->P0_20 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P0_20                    0
  #define PINCLR_P0_20                    0
  #define PINDIR_P0_20                    0 // Input

  /* ----- Pin P0[21]: EXP ----- */
  LPC_IOCON->P0_21 |= 0; // GPIO
//LPC_IOCON->P0_21 |= 1; // U1_RI
//LPC_IOCON->P0_21 |= 2; // SD_PWR
//LPC_IOCON->P0_21 |= 3; // U4_OE
//LPC_IOCON->P0_21 |= 4; // CAN_RD1
//LPC_IOCON->P0_21 = (LPC_IOCON->P0_21 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P0_21                    0
  #define PINCLR_P0_21                    0
  #define PINDIR_P0_21                    0 // Input

  /* ----- Pin P0[22]: EXP ----- */
  LPC_IOCON->P0_22 |= 0; // GPIO
//LPC_IOCON->P0_22 |= 1; // U1_RTS
//LPC_IOCON->P0_22 |= 2; // SD_DAT_0
//LPC_IOCON->P0_22 |= 3; // U4_TXD
//LPC_IOCON->P0_22 = (LPC_IOCON->P0_22 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P0_22                    0
  #define PINCLR_P0_22                    0
  #define PINDIR_P0_22                    0 // Input

  /* ----- Pin P0[23]: TOUCH; X+ (RIGHT) ----- */ 
//LPC_IOCON->P0_23 |= 0; // GPIO
  LPC_IOCON->P0_23 |= 1; // AD0_0
//LPC_IOCON->P0_23 |= 2; // I2S_RX_SCK
//LPC_IOCON->P0_23 |= 3; // T3_CAP0
LPC_IOCON->P0_23 = (LPC_IOCON->P0_23 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P0_23                    0
  #define PINCLR_P0_23                    0
  #define PINDIR_P0_23                    0 // Input

  /* ----- Pin P0[24]: TOUCH; Y+ (UP) ----- */ 
//LPC_IOCON->P0_24 |= 0; // GPIO
  LPC_IOCON->P0_24 |= 1; // AD0_1
//LPC_IOCON->P0_24 |= 2; // I2S_RX_WS
//LPC_IOCON->P0_24 |= 3; // T3_CAP1
LPC_IOCON->P0_24 = (LPC_IOCON->P0_24 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P0_24                    0
  #define PINCLR_P0_24                    0
  #define PINDIR_P0_24                    0 // Input

  /* ----- Pin P0[25]: NO CONNECT ----- */
  LPC_IOCON->P0_25 |= 0; // GPIO
//LPC_IOCON->P0_25 |= 1; // AD0_2
//LPC_IOCON->P0_25 |= 2; // I2S_RX_SDA
//LPC_IOCON->P0_25 |= 3; // U3_TXD
//LPC_IOCON->P0_25 = (LPC_IOCON->P0_25 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P0_25                    0
  #define PINCLR_P0_25                    0
  #define PINDIR_P0_25                    0 // Input

  /* ----- Pin P0[26]: EXP ----- */
//LPC_IOCON->P0_26 |= 0; // GPIO
//LPC_IOCON->P0_26 |= 1; // AD0_3
//TESTING:
LPC_IOCON->P0_26 = 2|  // DAC_OUT
        (0<<3)| // No pull-up or pull-down
        (0<<5)| // Disable hysteresis (not needed, output pin)
        (0<<6)| // Do not invert input
        (0<<7)| // Analog mode
        (0<<8)| // No glitch filter
        (0<<10)| // Normal push pull
        (1<<16); // Enable DAC
//LPC_IOCON->P0_26 |= 3; // U3_RXD
//LPC_IOCON->P0_26 = (LPC_IOCON->P0_26 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P0_26                    0
  #define PINCLR_P0_26                    0
  #define PINDIR_P0_26                    0 // Input

  /* ----- Pin P0[27]: NC ----- */
  LPC_IOCON->P0_27 |= 0; // GPIO
//LPC_IOCON->P0_27 |= 1; // I2C0_SDA
//    LPC_IOCON->P0_27 = (LPC_IOCON->P0_27 & ~(3<<10)) | (1<<10);
#if HAVE_LOC_REGISTERS
//      LPC_IOCON->LOC_I2C0_SDA = 1;
#endif
  //LPC_IOCON->P0_27 |= 2; // USB_SDA
//LPC_IOCON->P0_27 = (LPC_IOCON->P0_27 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_27                    0
  #define PINCLR_P0_27                    0
  #define PINDIR_P0_27                    0 // Input

  /* ----- Pin P0[28]: NC ----- */
  LPC_IOCON->P0_28 |= 0; // GPIO
//LPC_IOCON->P0_28 |= 1; // I2C0_SCL
//      LPC_IOCON->P0_28 = (LPC_IOCON->P0_28 & ~(3<<10)) | (1<<10);
#if HAVE_LOC_REGISTERS
      LPC_IOCON->LOC_I2C0_SCL = 1;
#endif
  //LPC_IOCON->P0_28 |= 2; // USB_SCL
//LPC_IOCON->P0_28 = (LPC_IOCON->P0_28 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_28                    0
  #define PINCLR_P0_28                    0
  #define PINDIR_P0_28                    0 // Input

  /* ----- Pin P0[29]: USB HOST DATA+ ----- */ 
//LPC_IOCON->P0_29 |= 0; // GPIO
  LPC_IOCON->P0_29 |= 1; // USB_DPLUS1
//LPC_IOCON->P0_29 |= 2; // EINT_0
//LPC_IOCON->P0_29 = (LPC_IOCON->P0_29 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_29                    0
  #define PINCLR_P0_29                    0
  #define PINDIR_P0_29                    0 // Input

  /* ----- Pin P0[30]: USB HOST DATA- ----- */ 
//LPC_IOCON->P0_30 |= 0; // GPIO
  LPC_IOCON->P0_30 |= 1; // USB_DMINUS1
//LPC_IOCON->P0_30 |= 2; // EINT_1
//LPC_IOCON->P0_30 = (LPC_IOCON->P0_30 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_30                    0
  #define PINCLR_P0_30                    0
  #define PINDIR_P0_30                    0 // Input

  /* ----- Pin P0[31]: USB DEVICE DATA+ ----- */ 
//LPC_IOCON->P0_31 |= 0; // GPIO
  LPC_IOCON->P0_31 |= 1; // USB_D+2
//LPC_IOCON->P0_31 = (LPC_IOCON->P0_31 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P0_31                    0
  #define PINCLR_P0_31                    0
  #define PINDIR_P0_31                    0 // Input



/*---------------------------------------------------------------------------*
 * Port 1 Configuration:
 *---------------------------------------------------------------------------*/
  /* ----- Pin P1[0 ]: ENET_TXD0 ----- */ 
//LPC_IOCON->P1_0  |= 0; // GPIO
  LPC_IOCON->P1_0  |= 1; // ENET_TXD0
//LPC_IOCON->P1_0  |= 3; // T3_CAP1
//LPC_IOCON->P1_0  |= 4; // SSP2_SCK
//LPC_IOCON->P1_0  = (LPC_IOCON->P1_0  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_0                     0
  #define PINCLR_P1_0                     0
  #define PINDIR_P1_0                     0 // Input

  /* ----- Pin P1[1 ]: ENET_TXD1 ----- */ 
//LPC_IOCON->P1_1  |= 0; // GPIO
  LPC_IOCON->P1_1  |= 1; // ENET_TXD1
//LPC_IOCON->P1_1  |= 3; // T3_MAT3
//LPC_IOCON->P1_1  |= 4; // SSP2_MOSI
//LPC_IOCON->P1_1  = (LPC_IOCON->P1_1  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_1                     0
  #define PINCLR_P1_1                     0
  #define PINDIR_P1_1                     0 // Input

  /* ----- Pin P1[2 ]: Backlight PWM ----- */
//LPC_IOCON->P1_2  |= 0; // GPIO
//LPC_IOCON->P1_2  |= 1; // ENET_TXD2
//LPC_IOCON->P1_2  |= 2; // SD_CLK
LPC_IOCON->P1_2  |= 3; // PWM0_1
//LPC_IOCON->P1_2  = (LPC_IOCON->P1_2  & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P1_2                     0
  #define PINCLR_P1_2                     0
  #define PINDIR_P1_2                     0 // Input

  /* ----- Pin P1[3 ]: NC ----- */ 
  LPC_IOCON->P1_3  |= 0; // GPIO
//LPC_IOCON->P1_3  |= 1; // ENET_TXD3
//LPC_IOCON->P1_3  |= 2; // SD_CMD
//LPC_IOCON->P1_3  |= 3; // PWM0_2
  LPC_IOCON->P1_3  = (LPC_IOCON->P1_3  & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P1_3                     0
  #define PINCLR_P1_3                     0
  #define PINDIR_P1_3                     0 // Input

  /* ----- Pin P1[4 ]: ENET_TX_EN ----- */ 
//LPC_IOCON->P1_4  |= 0; // GPIO
  LPC_IOCON->P1_4  |= 1; // ENET_TX_ENn
//LPC_IOCON->P1_4  |= 3; // T3_MAT2
//LPC_IOCON->P1_4  |= 4; // SSP2_MISO
//LPC_IOCON->P1_4  = (LPC_IOCON->P1_4  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_4                     0
  #define PINCLR_P1_4                     0
  #define PINDIR_P1_4                     0 // Input

  /* ----- Pin P1[5 ]: Hearbeat ----- */
  LPC_IOCON->P1_5  |= 0; // GPIO
//LPC_IOCON->P1_5  |= 1; // ENET_TX_ER
//LPC_IOCON->P1_5  |= 2; // SD_PWR
//LPC_IOCON->P1_5  |= 3; // PWM0_3
//LPC_IOCON->P1_5  = (LPC_IOCON->P1_5  & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P1_5                     0
  #define PINCLR_P1_5                     0
  #define PINDIR_P1_5                     1 // Output

  /* ----- Pin P1[6 ]: Expansion Board connected output pin ----- */
  LPC_IOCON->P1_6  |= 0; // GPIO
//LPC_IOCON->P1_6  |= 1; // ENET_TX_CLK
//LPC_IOCON->P1_6  |= 2; // SD_DAT_0
//LPC_IOCON->P1_6  |= 3; // PWM0_4
//LPC_IOCON->P1_6  = (LPC_IOCON->P1_6  & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P1_6                     0
  #define PINCLR_P1_6                     0
  #define PINDIR_P1_6                     1 // Output

