FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVM/IAR/flash_loader NOR/src/LPC1788_pinConfig.h
  /* ----- Pin P1[7 ]: NC ----- */ 
  LPC_IOCON->P1_7  |= 0; // GPIO
//LPC_IOCON->P1_7  |= 1; // ENET_COL
//LPC_IOCON->P1_7  |= 2; // SD_DAT_1
//LPC_IOCON->P1_7  |= 3; // PWM0_5
//LPC_IOCON->P1_7  = (LPC_IOCON->P1_7  & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P1_7                     0
  #define PINCLR_P1_7                     0
  #define PINDIR_P1_7                     0 // Input

  /* ----- Pin P1[8 ]: EXP - ENET_CRS_DV/ ENET_CRS  ----- */
//LPC_IOCON->P1_8  |= 0; // GPIO
  LPC_IOCON->P1_8  |= 1; // ENET_CRS
//LPC_IOCON->P1_8  |= 3; // T3_MAT1
//LPC_IOCON->P1_8  |= 4; // SSP2_SSEL
//LPC_IOCON->P1_8  = (LPC_IOCON->P1_8  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_8                     0
  #define PINCLR_P1_8                     0
  #define PINDIR_P1_8                     0 // Input

  /* ----- Pin P1[9 ]: ENET_RXD0  ----- */ 
//LPC_IOCON->P1_9  |= 0; // GPIO
  LPC_IOCON->P1_9  |= 1; // ENET_RXD0
//LPC_IOCON->P1_9  |= 2; // T3_MAT0
//LPC_IOCON->P1_9  = (LPC_IOCON->P1_9  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_9                     0
  #define PINCLR_P1_9                     0
  #define PINDIR_P1_9                     0 // Input

  /* ----- Pin P1[10]: ENET_RXD1  ----- */ 
//LPC_IOCON->P1_10 |= 0; // GPIO
  LPC_IOCON->P1_10 |= 1; // ENET_RXD1
//LPC_IOCON->P1_10 |= 2; // T3_CAP0
//LPC_IOCON->P1_10 = (LPC_IOCON->P1_10 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_10                    0
  #define PINCLR_P1_10                    0
  #define PINDIR_P1_10                    0 // Input

  /* ----- Pin P1[11]: NC ----- */ 
  LPC_IOCON->P1_11 |= 0; // GPIO
//LPC_IOCON->P1_11 |= 1; // ENET_RXD2
//LPC_IOCON->P1_11 |= 2; // SD_DAT_2
//LPC_IOCON->P1_11 |= 3; // PWM0_6
  LPC_IOCON->P1_11 = (LPC_IOCON->P1_11 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P1_11                    0
  #define PINCLR_P1_11                    0
  #define PINDIR_P1_11                    0 // Input

  /* ----- Pin P1[12]: NC ----- */ 
  LPC_IOCON->P1_12 |= 0; // GPIO
//LPC_IOCON->P1_12 |= 1; // ENET_RXD3
//LPC_IOCON->P1_12 |= 2; // SD_DAT_3
//LPC_IOCON->P1_12 |= 3; // PWM_CAP0
  LPC_IOCON->P1_12 = (LPC_IOCON->P1_12 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_12                    0
  #define PINCLR_P1_12                    0
  #define PINDIR_P1_12                    0 // Input

  /* ----- Pin P1[13]: NC ----- */ 
  LPC_IOCON->P1_13 |= 0; // GPIO
//LPC_IOCON->P1_13 |= 1; // ENET_RX_DV
//LPC_IOCON->P1_13 = (LPC_IOCON->P1_13 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P1_13                    0
  #define PINCLR_P1_13                    0
  #define PINDIR_P1_13                    1 // Output

  /* ----- Pin P1[14]: ENET_RX_ER  ----- */ 
//LPC_IOCON->P1_14 |= 0; // GPIO
  LPC_IOCON->P1_14 |= 1; // ENET_RX_ER
//LPC_IOCON->P1_14 = (LPC_IOCON->P1_14 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_14                    0
  #define PINCLR_P1_14                    0
  #define PINDIR_P1_14                    0 // Input

  /* ----- Pin P1[15]: ENET_REF_CLK /ENET_RX_CLK  ----- */ 
//LPC_IOCON->P1_15 |= 0; // GPIO
  LPC_IOCON->P1_15 |= 1; // ENET_RX_CLK
//LPC_IOCON->P1_15 |= 3; // I2C2_SDA
//LPC_IOCON->P1_15 = (LPC_IOCON->P1_15 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_15                    0
  #define PINCLR_P1_15                    0
  #define PINDIR_P1_15                    0 // Input

  /* ----- Pin P1[16]: ENET_MDC  ----- */ 
//LPC_IOCON->P1_16 |= 0; // GPIO
  LPC_IOCON->P1_16 |= 1; // ENET_MDC
//LPC_IOCON->P1_16 = (LPC_IOCON->P1_16 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_16                    0
  #define PINCLR_P1_16                    0
  #define PINDIR_P1_16                    0 // Input

  /* ----- Pin P1[17]: ENET_MDIO  ----- */ 
//LPC_IOCON->P1_17 |= 0; // GPIO
  LPC_IOCON->P1_17 |= 1; // ENET_MDIO
//LPC_IOCON->P1_17 = (LPC_IOCON->P1_17 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_17                    0
  #define PINCLR_P1_17                    0
  #define PINDIR_P1_17                    0 // Input
#if HAVE_LOC_REGISTERS
  LPC_IOCON->LOC_ENET_MDIO = 0x01;  // Change to MDIO
#endif

  /* ----- Pin P1[18]: NC ----- */
  LPC_IOCON->P1_18 |= 0; // GPIO
//LPC_IOCON->P1_18 |= 1; // USB_UP_LED1
//LPC_IOCON->P1_18 |= 2; // PWM1_1
//LPC_IOCON->P1_18 |= 3; // T1_CAP0
//LPC_IOCON->P1_18 |= 5; // SSP1_MISO
LPC_IOCON->P1_18 = (LPC_IOCON->P1_18 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P1_18                    0
  #define PINCLR_P1_18                    0
  #define PINDIR_P1_18                    0 // Input

  /* ----- Pin P1[19]: USB HOST POWER ENABLE OUTPUT, USB HW ----- */ 
//LPC_IOCON->P1_19 |= 0; // GPIO
//LPC_IOCON->P1_19 |= 1; // USB_TX_E1n
  LPC_IOCON->P1_19 |= 2; // USB_PPWR1n
//LPC_IOCON->P1_19 |= 3; // T1_CAP1
//LPC_IOCON->P1_19 |= 4; // MC_0A
//LPC_IOCON->P1_19 |= 5; // SSP1_SCK
//LPC_IOCON->P1_19 |= 6; // U2_OE
//LPC_IOCON->P1_19 = (LPC_IOCON->P1_19 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_19                    0
  #define PINCLR_P1_19                    0
  #define PINDIR_P1_19                    0 // Input

  /* ----- Pin P1[20]: LCDVD[10] ----- */ 
//LPC_IOCON->P1_20 |= 0; // GPIO
//LPC_IOCON->P1_20 |= 1; // USB_TX_DP1
//LPC_IOCON->P1_20 |= 2; // PWM1_2
//LPC_IOCON->P1_20 |= 3; // QEI_PHA
//LPC_IOCON->P1_20 |= 4; // MC_FB0
//LPC_IOCON->P1_20 |= 5; // SSP0_SCK0
//LPC_IOCON->P1_20 |= 6; // LCD_VD6
  LPC_IOCON->P1_20 |= 7; // LCD_VD10
//LPC_IOCON->P1_20 = (LPC_IOCON->P1_20 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_20                    0
  #define PINCLR_P1_20                    0
  #define PINDIR_P1_20                    0 // Input

  /* ----- Pin P1[21]: LCDVD[11] ----- */ 
//LPC_IOCON->P1_21 |= 0; // GPIO
//LPC_IOCON->P1_21 |= 1; // USB_TX_DM1
//LPC_IOCON->P1_21 |= 2; // PWM1_3
//LPC_IOCON->P1_21 |= 3; // SSP0_SSEL
//LPC_IOCON->P1_21 |= 4; // MCABORTn
//LPC_IOCON->P1_21 |= 6; // LCD_VD7
  LPC_IOCON->P1_21 |= 7; // LCD_VD11
//LPC_IOCON->P1_21 = (LPC_IOCON->P1_21 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_21                    0
  #define PINCLR_P1_21                    0
  #define PINDIR_P1_21                    0 // Input

  /* ----- Pin P1[22]: LCDVD[12] ----- */ 
//LPC_IOCON->P1_22 |= 0; // GPIO
//LPC_IOCON->P1_22 |= 1; // USB_RCV1
//LPC_IOCON->P1_22 |= 2; // USB_PWRD1
//LPC_IOCON->P1_22 |= 3; // T1_MAT0
//LPC_IOCON->P1_22 |= 4; // MC_0B
//LPC_IOCON->P1_22 |= 5; // SSP1_MOSI
//LPC_IOCON->P1_22 |= 6; // LCD_VD8
  LPC_IOCON->P1_22 |= 7; // LCD_VD12
//LPC_IOCON->P1_22 = (LPC_IOCON->P1_22 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_22                    0
  #define PINCLR_P1_22                    0
  #define PINDIR_P1_22                    0 // Input

  /* ----- Pin P1[23]: LCDVD[13] ----- */ 
//LPC_IOCON->P1_23 |= 0; // GPIO
//LPC_IOCON->P1_23 |= 1; // USB_RX_DP1
//LPC_IOCON->P1_23 |= 2; // PWM1_4
//LPC_IOCON->P1_23 |= 3; // QEI_PHB
//LPC_IOCON->P1_23 |= 4; // MC_FB1
//LPC_IOCON->P1_23 |= 5; // SSP0_MISO
//LPC_IOCON->P1_23 |= 6; // LCD_VD9
  LPC_IOCON->P1_23 |= 7; // LCD_VD13
//LPC_IOCON->P1_23 = (LPC_IOCON->P1_23 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_23                    0
  #define PINCLR_P1_23                    0
  #define PINDIR_P1_23                    0 // Input

  /* ----- Pin P1[24]: LCDVD[14]  ----- */ 
//LPC_IOCON->P1_24 |= 0; // GPIO
//LPC_IOCON->P1_24 |= 1; // USB_RX_DM1
//LPC_IOCON->P1_24 |= 2; // PWM1_5
//LPC_IOCON->P1_24 |= 3; // QEI_IDX
//LPC_IOCON->P1_24 |= 4; // MC_FB2
//LPC_IOCON->P1_24 |= 5; // SSP0_MOSI
//LPC_IOCON->P1_24 |= 6; // LCD_VD10
  LPC_IOCON->P1_24 |= 7; // LCD_VD14
//LPC_IOCON->P1_24 = (LPC_IOCON->P1_24 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_24                    0
  #define PINCLR_P1_24                    0
  #define PINDIR_P1_24                    0 // Input

  /* ----- Pin P1[25]: LCDVD[15]  ----- */ 
//LPC_IOCON->P1_25 |= 0; // GPIO
//LPC_IOCON->P1_25 |= 1; // USB_LS1n
//LPC_IOCON->P1_25 |= 2; // USB_HSTEN1n
//LPC_IOCON->P1_25 |= 3; // T1_MAT1
//LPC_IOCON->P1_25 |= 4; // MC_1A
//LPC_IOCON->P1_25 |= 5; // CLKOUT
//LPC_IOCON->P1_25 |= 6; // LCD_VD11
  LPC_IOCON->P1_25 |= 7; // LCD_VD15
//LPC_IOCON->P1_25 = (LPC_IOCON->P1_25 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_25                    0
  #define PINCLR_P1_25                    0
  #define PINDIR_P1_25                    0 // Input

  /* ----- Pin P1[26]: LCDVD[20]  ----- */ 
//LPC_IOCON->P1_26 |= 0; // GPIO
//LPC_IOCON->P1_26 |= 1; // USB_SSPND1n
//LPC_IOCON->P1_26 |= 2; // PWM1_6
//LPC_IOCON->P1_26 |= 3; // T0_CAP0
//LPC_IOCON->P1_26 |= 4; // MC_1B
//LPC_IOCON->P1_26 |= 5; // SSP1_SSEL
//LPC_IOCON->P1_26 |= 6; // LCD_VD12
  LPC_IOCON->P1_26 |= 7; // LCD_VD20
//LPC_IOCON->P1_26 = (LPC_IOCON->P1_26 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_26                    0
  #define PINCLR_P1_26                    0
  #define PINDIR_P1_26                    0 // Input

  /* ----- Pin P1[27]: LCDVD[21]  ----- */ 
//LPC_IOCON->P1_27 |= 0; // GPIO
//LPC_IOCON->P1_27 |= 1; // USB_INT1n
//LPC_IOCON->P1_27 |= 2; // USB_OVRCR1n
//LPC_IOCON->P1_27 |= 3; // T0_CAP1
//LPC_IOCON->P1_27 |= 4; // CLKOUT
//LPC_IOCON->P1_27 |= 6; // LCD_VD13
  LPC_IOCON->P1_27 |= 7; // LCD_VD21
//LPC_IOCON->P1_27 = (LPC_IOCON->P1_27 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_27                    0
  #define PINCLR_P1_27                    0
  #define PINDIR_P1_27                    0 // Input

  /* ----- Pin P1[28]: LCDVD[22]  ----- */ 
//LPC_IOCON->P1_28 |= 0; // GPIO
//LPC_IOCON->P1_28 |= 1; // USB_SCL1
//LPC_IOCON->P1_28 |= 2; // PWM1_CAP0
//LPC_IOCON->P1_28 |= 3; // T0_MAT0
//LPC_IOCON->P1_28 |= 4; // MC_2A
//LPC_IOCON->P1_28 |= 5; // SSP0_SSEL
//LPC_IOCON->P1_28 |= 6; // LCD_VD14
  LPC_IOCON->P1_28 |= 7; // LCD_VD22
//LPC_IOCON->P1_28 = (LPC_IOCON->P1_28 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_28                    0
  #define PINCLR_P1_28                    0
  #define PINDIR_P1_28                    0 // Input

  /* ----- Pin P1[29]: LCDVD[23]  ----- */ 
//LPC_IOCON->P1_29 |= 0; // GPIO
//LPC_IOCON->P1_29 |= 1; // USB_SDA1
//LPC_IOCON->P1_29 |= 2; // PWM1_CAP1
//LPC_IOCON->P1_29 |= 3; // T0_MAT1
//LPC_IOCON->P1_29 |= 4; // MC_2B
//LPC_IOCON->P1_29 |= 5; // U4_TXD
//LPC_IOCON->P1_29 |= 6; // LCD_VD15
  LPC_IOCON->P1_29 |= 7; // LCD_VD23
//LPC_IOCON->P1_29 = (LPC_IOCON->P1_29 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P1_29                    0
  #define PINCLR_P1_29                    0
  #define PINDIR_P1_29                    0 // Input

