FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVM/IAR/flash_loader NOR/src/LPC1788_pinConfig.h
  /* ----- Pin P1[30]: USB DEVICE POWER DETECT - VBUS ----- */ 
  LPC_IOCON->P1_30 |= 0; // GPIO
//LPC_IOCON->P1_30 |= 1; // USB_PWRD2
//??LPC_IOCON->P1_30 |= 2; // USB_VBUS
//LPC_IOCON->P1_30 |= 3; // AD0_4
//LPC_IOCON->P1_30 |= 4; // I2C0_SDA
//LPC_IOCON->P1_30 |= 5; // U3_OE
  LPC_IOCON->P1_30 = (LPC_IOCON->P1_30 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P1_30                    0
  #define PINCLR_P1_30                    0
  #define PINDIR_P1_30                    0 // Input

  /* ----- Pin P1[31]: EXP ----- */
  LPC_IOCON->P1_31 |= 0; // GPIO
//LPC_IOCON->P1_31 |= 1; // USB_OVRCR2n
//LPC_IOCON->P1_31 |= 2; // SSP1_SCK
//LPC_IOCON->P1_31 |= 3; // AD0_5
//LPC_IOCON->P1_31 |= 4; // I2C0_SCL
  LPC_IOCON->P1_31 = (LPC_IOCON->P1_31 & ~(3<<3)) | (1<<3); // Pull-down 
  #define PINSET_P1_31                    0
  #define PINCLR_P1_31                    0
  #define PINDIR_P1_31                    0 // Input



/*---------------------------------------------------------------------------*
 * Port 2 Configuration:
 *---------------------------------------------------------------------------*/
  /* ----- Pin P2[0 ]: LCDPWR ----- */ 
//LPC_IOCON->P2_0  |= 0; // GPIO
//LPC_IOCON->P2_0  |= 1; // PWM1_1
//LPC_IOCON->P2_0  |= 2; // U1_TXD
  LPC_IOCON->P2_0  |= 7; // LCD_PWR
//LPC_IOCON->P2_0  = (LPC_IOCON->P2_0  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_0                     1
  #define PINCLR_P2_0                     0
  #define PINDIR_P2_0                     1 // Output

  /* ----- Pin P2[1 ]: New SPKR ----- */
//LPC_IOCON->P2_1  |= 0; // GPIO
  LPC_IOCON->P2_1  |= 1; // PWM1_2
//LPC_IOCON->P2_1  |= 2; // U1_RXD
//LPC_IOCON->P2_1  |= 7; // LCD_LE
//LPC_IOCON->P2_1  = (LPC_IOCON->P2_1  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_1                     0
  #define PINCLR_P2_1                     0
  #define PINDIR_P2_1                     0 // Input

  /* ----- Pin P2[2 ]: LCDDCLK  ----- */ 
//LPC_IOCON->P2_2  |= 0; // GPIO
//LPC_IOCON->P2_2  |= 1; // PWM1_3
//LPC_IOCON->P2_2  |= 2; // U1_CTS
//LPC_IOCON->P2_2  |= 3; // T2_MAT3
//LPC_IOCON->P2_2  |= 5; // TRACEDATA_3
  LPC_IOCON->P2_2  |= 7; // LCD_DCLK
//LPC_IOCON->P2_2  = (LPC_IOCON->P2_2  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_2                     0
  #define PINCLR_P2_2                     0
  #define PINDIR_P2_2                     0 // Input

  /* ----- Pin P2[3 ]: Volume Control  ----- */
  LPC_IOCON->P2_3  |= 0; // GPIO
//LPC_IOCON->P2_3  |= 1; // PWM1_4
//LPC_IOCON->P2_3  |= 2; // U1_DCD
//LPC_IOCON->P2_3  |= 3; // T2_MAT2
//LPC_IOCON->P2_3  |= 5; // TRACEDATA_2
//LPC_IOCON->P2_3  |= 7; // LCD_FP
//LPC_IOCON->P2_3  = (LPC_IOCON->P2_3  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_3                     0
  #define PINCLR_P2_3                     0
  #define PINDIR_P2_3                     0 // Input

  /* ----- Pin P2[4 ]: LCDENAB ----- */ 
//LPC_IOCON->P2_4  |= 0; // GPIO
//LPC_IOCON->P2_4  |= 1; // PWM1_5
//LPC_IOCON->P2_4  |= 2; // U1_DSR
//LPC_IOCON->P2_4  |= 3; // T2_MAT1
//LPC_IOCON->P2_4  |= 5; // TRACEDATA_1
  LPC_IOCON->P2_4  |= 7; // LCD_ENAB_M
//LPC_IOCON->P2_4  = (LPC_IOCON->P2_4  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_4                     0
  #define PINCLR_P2_4                     0
  #define PINDIR_P2_4                     0 // Input

  /* ----- Pin P2[5 ]: Audio Amp Mode ----- */
  LPC_IOCON->P2_5  |= 0; // GPIO
//LPC_IOCON->P2_5  |= 1; // PWM1_6
//LPC_IOCON->P2_5  |= 2; // U1_DTR
//LPC_IOCON->P2_5  |= 3; // T2_MAT0
//LPC_IOCON->P2_5  |= 5; // TRACEDATA_0
//LPC_IOCON->P2_5  |= 7; // LCD_LP
//LPC_IOCON->P2_5  = (LPC_IOCON->P2_5  & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P2_5                     1
  #define PINCLR_P2_5                     0
  #define PINDIR_P2_5                     1 // Output

  /* ----- Pin P2[6 ]: LCDVD[4]  ----- */ 
//LPC_IOCON->P2_6  |= 0; // GPIO
//LPC_IOCON->P2_6  |= 1; // PWM1_CAP0
//LPC_IOCON->P2_6  |= 2; // U1_RI
//LPC_IOCON->P2_6  |= 3; // T2_CAP0
//LPC_IOCON->P2_6  |= 4; // U2_OE
//LPC_IOCON->P2_6  |= 5; // TRACECLK
//LPC_IOCON->P2_6  |= 6; // LCD_VD0
  LPC_IOCON->P2_6  |= 7; // LCD_VD4
//LPC_IOCON->P2_6  = (LPC_IOCON->P2_6  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_6                     0
  #define PINCLR_P2_6                     0
  #define PINDIR_P2_6                     0 // Input

  /* ----- Pin P2[7 ]: LCDVD[5]  ----- */ 
//LPC_IOCON->P2_7  |= 0; // GPIO
//LPC_IOCON->P2_7  |= 1; // CAN_RD2
//LPC_IOCON->P2_7  |= 2; // U1_RTS
//LPC_IOCON->P2_7  |= 6; // LCD_VD1
  LPC_IOCON->P2_7  |= 7; // LCD_VD5
//LPC_IOCON->P2_7  = (LPC_IOCON->P2_7  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_7                     0
  #define PINCLR_P2_7                     0
  #define PINDIR_P2_7                     0 // Input

  /* ----- Pin P2[8 ]: LCDVD[6]  ----- */ 
//LPC_IOCON->P2_8  |= 0; // GPIO
//LPC_IOCON->P2_8  |= 1; // CAN_TD2
//LPC_IOCON->P2_8  |= 2; // U2_TXD
//LPC_IOCON->P2_8  |= 3; // U1_CTS
//LPC_IOCON->P2_8  |= 4; // ENET_MDC
//LPC_IOCON->P2_8  |= 6; // LCD_VD2
  LPC_IOCON->P2_8  |= 7; // LCD_VD6
//LPC_IOCON->P2_8  = (LPC_IOCON->P2_8  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_8                     0
  #define PINCLR_P2_8                     0
  #define PINDIR_P2_8                     0 // Input

  /* ----- Pin P2[9 ]: LCDVD[7]  ----- */ 
//LPC_IOCON->P2_9  |= 0; // GPIO
//LPC_IOCON->P2_9  |= 1; // USB_CONNECT1
//LPC_IOCON->P2_9  |= 2; // U2_RXD
//LPC_IOCON->P2_9  |= 3; // U4_RXD
//LPC_IOCON->P2_9  |= 4; // ENET_MDIO
//LPC_IOCON->P2_9  |= 6; // LCD_VD3
  LPC_IOCON->P2_9  |= 7; // LCD_VD7
//LPC_IOCON->P2_9  = (LPC_IOCON->P2_9  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_9                     0
  #define PINCLR_P2_9                     0
  #define PINDIR_P2_9                     0 // Input

  /* ----- Pin P2[10]: ETHERNET PHY IRQ INPUT /  ISP_ENTRY ----- */ 
  LPC_IOCON->P2_10 |= 0; // GPIO
//LPC_IOCON->P2_10 |= 1; // EINT0
//LPC_IOCON->P2_10 |= 2; // NMI
  LPC_IOCON->P2_10 = (LPC_IOCON->P2_10 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_10                    0
  #define PINCLR_P2_10                    0
  #define PINDIR_P2_10                    0 // Input

