FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVM/IAR/flash_loader NOR/src/LPC1788_pinConfig.h
  /* ----- Pin P2[11]: EINT1n / RTC_IRQ ----- */
  LPC_IOCON->P2_11 |= 0; // GPIO
//LPC_IOCON->P2_11 |= 1; // EINT1
//LPC_IOCON->P2_11 |= 2; // SD_DAT_1
//LPC_IOCON->P2_11 |= 3; // I2S_TX_SCK
//LPC_IOCON->P2_11 |= 7; // LCD_CLKIN
  LPC_IOCON->P2_11 = (LPC_IOCON->P2_11 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_11                    0
  #define PINCLR_P2_11                    0
  #define PINDIR_P2_11                    0 // Input

  /* ----- Pin P2[12]: LCDVD[18]  ----- */ 
//LPC_IOCON->P2_12 |= 0; // GPIO
//LPC_IOCON->P2_12 |= 1; // EINT2
//LPC_IOCON->P2_12 |= 2; // SD_DAT_2
//LPC_IOCON->P2_12 |= 3; // I2S_TX_WS
//LPC_IOCON->P2_12 |= 4; // LCD_VD4
//LPC_IOCON->P2_12 |= 5; // LCD_VD3
//LPC_IOCON->P2_12 |= 6; // LCD_VD8
  LPC_IOCON->P2_12 |= 7; // LCD_VD18
//LPC_IOCON->P2_12 = (LPC_IOCON->P2_12 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_12                    0
  #define PINCLR_P2_12                    0
  #define PINDIR_P2_12                    0 // Input

  /* ----- Pin P2[13]: LCDVD[19]  ----- */ 
//LPC_IOCON->P2_13 |= 0; // GPIO
//LPC_IOCON->P2_13 |= 1; // EINT3
//LPC_IOCON->P2_13 |= 2; // SD_DAT_3
//LPC_IOCON->P2_13 |= 3; // I2S_TX_SDA
//LPC_IOCON->P2_13 |= 5; // LCD_VD5
//LPC_IOCON->P2_13 |= 6; // LCD_VD9
  LPC_IOCON->P2_13 |= 7; // LCD_VD19
//LPC_IOCON->P2_13 = (LPC_IOCON->P2_13 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_13                    0
  #define PINCLR_P2_13                    0
  #define PINDIR_P2_13                    0 // Input

  /* ----- Pin P2[14]: Local I2C SDA1 ----- */
//LPC_IOCON->P2_14 |= 0; // GPIO
//LPC_IOCON->P2_14 |= 1; // EMC_CS2n
  LPC_IOCON->P2_14 |= 2; // I2C1_SDA
//LPC_IOCON->P2_14 |= 3; // T2_CAP0
//  LPC_IOCON->P2_14 = (LPC_IOCON->P2_14 & ~(3<<3)) | (2<<3); // Pull-up
  LPC_IOCON->P2_14 = (LPC_IOCON->P2_14 & ~(3<<10)) | (1<<10);
  #define PINSET_P2_14                    0
  #define PINCLR_P2_14                    0
  #define PINDIR_P2_14                    0 // Input

  /* ----- Pin P2[15]: NC ----- */ 
//LPC_IOCON->P2_15 |= 0; // GPIO
//LPC_IOCON->P2_15 |= 1; // EMC_CS3n
  LPC_IOCON->P2_15 |= 2; // I2C1_SCL
//LPC_IOCON->P2_15 |= 3; // T2_CAP1
      LPC_IOCON->P2_15 = (LPC_IOCON->P2_15 & ~(3<<10)) | (1<<10);
//  LPC_IOCON->P2_15 = (LPC_IOCON->P2_15 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P2_15                    0
  #define PINCLR_P2_15                    0
  #define PINDIR_P2_15                    0 // Input

  /* ----- Pin P2[16]: SDRAM CASn ----- */
//LPC_IOCON->P2_16 |= 0; // GPIO
  LPC_IOCON->P2_16 |= 1; // EMC_CASn
//LPC_IOCON->P2_16 = (LPC_IOCON->P2_16 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_16                    0
  #define PINCLR_P2_16                    0
  #define PINDIR_P2_16                    0 // Input

  /* ----- Pin P2[17]: SDRAM RASn ----- */
//LPC_IOCON->P2_17 |= 0; // GPIO
  LPC_IOCON->P2_17 |= 1; // EMC_RASn
//LPC_IOCON->P2_17 = (LPC_IOCON->P2_17 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_17                    0
  #define PINCLR_P2_17                    0
  #define PINDIR_P2_17                    0 // Input

  /* ----- Pin P2[18]: SDRAM CLK OUT ----- */
//LPC_IOCON->P2_18 |= 0; // GPIO
  LPC_IOCON->P2_18 |= 1; // EMC_CLK_0
//LPC_IOCON->P2_18 = (LPC_IOCON->P2_18 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_18                    0
  #define PINCLR_P2_18                    0
  #define PINDIR_P2_18                    0 // Input

  /* ----- Pin P2[19]: NC ----- */
  LPC_IOCON->P2_19 |= 0; // GPIO
//LPC_IOCON->P2_19 |= 1; // EMC_CLK_1
LPC_IOCON->P2_19 = (LPC_IOCON->P2_19 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P2_19                    0
  #define PINCLR_P2_19                    0
  #define PINDIR_P2_19                    0 // Input

  /* ----- Pin P2[20]: SDRAM CSn ----- */
//LPC_IOCON->P2_20 |= 0; // GPIO
  LPC_IOCON->P2_20 |= 1; // EMC_DYCS0n
//LPC_IOCON->P2_20 = (LPC_IOCON->P2_20 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_20                    0
  #define PINCLR_P2_20                    0
  #define PINDIR_P2_20                    0 // Input

  /* ----- Pin P2[21]: Micro SD CS ----- */
  LPC_IOCON->P2_21 |= 0; // GPIO
//LPC_IOCON->P2_21 |= 1; // EMC_DYCS1n
  LPC_IOCON->P2_21 = (LPC_IOCON->P2_21 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_21                    1
  #define PINCLR_P2_21                    0
  #define PINDIR_P2_21                    1 // Output

  /* ----- Pin P2[22]: SCK0 ----- */
//LPC_IOCON->P2_22 |= 0; // GPIO
//LPC_IOCON->P2_22 |= 1; // EMC_DYCS2n
  LPC_IOCON->P2_22 |= 2; // SSP0_SCK
//LPC_IOCON->P2_22 |= 3; // T3_CAP0
//LPC_IOCON->P2_22 = (LPC_IOCON->P2_22 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P2_22                    0
  #define PINCLR_P2_22                    0
  #define PINDIR_P2_22                    0 // Input

  /* ----- Pin P2[23]: WIFI CS ----- */
  LPC_IOCON->P2_23 |= 0; // GPIO
//LPC_IOCON->P2_23 |= 1; // EMC_DYCS3n
//LPC_IOCON->P2_23 |= 2; // SSP0_SSEL
//LPC_IOCON->P2_23 |= 3; // T3_CAP1
//LPC_IOCON->P2_23 = (LPC_IOCON->P2_23 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P2_23                    1
  #define PINCLR_P2_23                    0
  #define PINDIR_P2_23                    1 // Output

  /* ----- Pin P2[24]: SDRAM Clock Enable ----- */
//LPC_IOCON->P2_24 |= 0; // GPIO
  LPC_IOCON->P2_24 |= 1; // EMC_CKE0
//LPC_IOCON->P2_24 = (LPC_IOCON->P2_24 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_24                    0
  #define PINCLR_P2_24                    0
  #define PINDIR_P2_24                    0 // Input

  /* ----- Pin P2[25]: 3V_ERR ----- */
  LPC_IOCON->P2_25 |= 0; // GPIO
//LPC_IOCON->P2_25 |= 1; // EMC_CKE1
  LPC_IOCON->P2_25 = (LPC_IOCON->P2_25 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_25                    0
  #define PINCLR_P2_25                    0
  #define PINDIR_P2_25                    0 // Input

  /* ----- Pin P2[26]: MISO0 ----- */
//LPC_IOCON->P2_26 |= 0; // GPIO
//LPC_IOCON->P2_26 |= 1; // EMC_CKE2
  LPC_IOCON->P2_26 |= 2; // SSP0_MISO
//LPC_IOCON->P2_26 |= 3; // T3_MAT0
//LPC_IOCON->P2_26 = (LPC_IOCON->P2_26 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_26                    0
  #define PINCLR_P2_26                    0
  #define PINDIR_P2_26                    0 // Input

  /* ----- Pin P2[27]: MOSI0 ----- */
//LPC_IOCON->P2_27 |= 0; // GPIO
//LPC_IOCON->P2_27 |= 1; // EMC_CKE3
  LPC_IOCON->P2_27 |= 2; // SSP0_MOSI
//LPC_IOCON->P2_27 |= 3; // T3_MAT1
  LPC_IOCON->P2_27 = (LPC_IOCON->P2_27 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_27                    0
  #define PINCLR_P2_27                    0
  #define PINDIR_P2_27                    0 // Input

