FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVM/IAR/flash_loader NOR/src/LPC1788_pinConfig.h
  /* ----- Pin P2[28]: SDRAM DATA Q Mask 0 ----- */
//LPC_IOCON->P2_28 |= 0; // GPIO
  LPC_IOCON->P2_28 |= 1; // EMC_DQM0
//LPC_IOCON->P2_28 = (LPC_IOCON->P2_28 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_28                    0
  #define PINCLR_P2_28                    0
  #define PINDIR_P2_28                    0 // Input

  /* ----- Pin P2[29]: SDRAM Data Q Mask 1 ----- */
//LPC_IOCON->P2_29 |= 0; // GPIO
  LPC_IOCON->P2_29 |= 1; // EMC_DQM1
//LPC_IOCON->P2_29 = (LPC_IOCON->P2_29 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_29                    0
  #define PINCLR_P2_29                    0
  #define PINDIR_P2_29                    0 // Input

  /* ----- Pin P2[30]: SDRAM Data Q Mask 2 ----- */
//LPC_IOCON->P2_30 |= 0; // GPIO
  LPC_IOCON->P2_30 |= 1; // EMC_DQM2
//LPC_IOCON->P2_30 |= 2; // I2C2_SDA
//LPC_IOCON->P2_30 |= 3; // T3_MAT2
//LPC_IOCON->P2_30 = (LPC_IOCON->P2_30 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_30                    0
  #define PINCLR_P2_30                    0
  #define PINDIR_P2_30                    0 // Input

  /* ----- Pin P2[31]: SDRAM Data Q Mask 3 ----- */
//LPC_IOCON->P2_31 |= 0; // GPIO
  LPC_IOCON->P2_31 |= 1; // EMC_DQM3
//LPC_IOCON->P2_31 |= 2; // I2C2_SCL
//LPC_IOCON->P2_31 |= 3; // T3_MAT3
//LPC_IOCON->P2_31 = (LPC_IOCON->P2_31 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P2_31                    0
  #define PINCLR_P2_31                    0
  #define PINDIR_P2_31                    0 // Input



/*---------------------------------------------------------------------------*
 * Port 3 Configuration:
 *---------------------------------------------------------------------------*/
  /* ----- Pin P3[0 ]: ----- */ 
//LPC_IOCON->P3_0  |= 0; // GPIO
  LPC_IOCON->P3_0  |= 1; // EMC_D0
//LPC_IOCON->P3_0  = (LPC_IOCON->P3_0  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_0                     0
  #define PINCLR_P3_0                     0
  #define PINDIR_P3_0                     0 // Input

  /* ----- Pin P3[1 ]: ----- */ 
//LPC_IOCON->P3_1  |= 0; // GPIO
  LPC_IOCON->P3_1  |= 1; // EMC_D1
//LPC_IOCON->P3_1  = (LPC_IOCON->P3_1  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_1                     0
  #define PINCLR_P3_1                     0
  #define PINDIR_P3_1                     0 // Input

  /* ----- Pin P3[2 ]: ----- */ 
//LPC_IOCON->P3_2  |= 0; // GPIO
  LPC_IOCON->P3_2  |= 1; // EMC_D2
//LPC_IOCON->P3_2  = (LPC_IOCON->P3_2  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_2                     0
  #define PINCLR_P3_2                     0
  #define PINDIR_P3_2                     0 // Input

  /* ----- Pin P3[3 ]: ----- */ 
//LPC_IOCON->P3_3  |= 0; // GPIO
  LPC_IOCON->P3_3  |= 1; // EMC_D3
//LPC_IOCON->P3_3  = (LPC_IOCON->P3_3  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_3                     0
  #define PINCLR_P3_3                     0
  #define PINDIR_P3_3                     0 // Input

  /* ----- Pin P3[4 ]: ----- */ 
//LPC_IOCON->P3_4  |= 0; // GPIO
  LPC_IOCON->P3_4  |= 1; // EMC_D4
//LPC_IOCON->P3_4  = (LPC_IOCON->P3_4  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_4                     0
  #define PINCLR_P3_4                     0
  #define PINDIR_P3_4                     0 // Input

  /* ----- Pin P3[5 ]: ----- */ 
//LPC_IOCON->P3_5  |= 0; // GPIO
  LPC_IOCON->P3_5  |= 1; // EMC_D5
//LPC_IOCON->P3_5  = (LPC_IOCON->P3_5  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_5                     0
  #define PINCLR_P3_5                     0
  #define PINDIR_P3_5                     0 // Input

  /* ----- Pin P3[6 ]: ----- */ 
//LPC_IOCON->P3_6  |= 0; // GPIO
  LPC_IOCON->P3_6  |= 1; // EMC_D6
//LPC_IOCON->P3_6  = (LPC_IOCON->P3_6  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_6                     0
  #define PINCLR_P3_6                     0
  #define PINDIR_P3_6                     0 // Input

  /* ----- Pin P3[7 ]: ----- */ 
//LPC_IOCON->P3_7  |= 0; // GPIO
  LPC_IOCON->P3_7  |= 1; // EMC_D7
//LPC_IOCON->P3_7  = (LPC_IOCON->P3_7  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_7                     0
  #define PINCLR_P3_7                     0
  #define PINDIR_P3_7                     0 // Input

  /* ----- Pin P3[8 ]: ----- */ 
//LPC_IOCON->P3_8  |= 0; // GPIO
  LPC_IOCON->P3_8  |= 1; // EMC_D8
//LPC_IOCON->P3_8  = (LPC_IOCON->P3_8  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_8                     0
  #define PINCLR_P3_8                     0
  #define PINDIR_P3_8                     0 // Input

  /* ----- Pin P3[9 ]: ----- */ 
//LPC_IOCON->P3_9  |= 0; // GPIO
  LPC_IOCON->P3_9  |= 1; // EMC_D9
//LPC_IOCON->P3_9  = (LPC_IOCON->P3_9  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_9                     0
  #define PINCLR_P3_9                     0
  #define PINDIR_P3_9                     0 // Input

  /* ----- Pin P3[10]: ----- */ 
//LPC_IOCON->P3_10 |= 0; // GPIO
  LPC_IOCON->P3_10 |= 1; // EMC_D10
//LPC_IOCON->P3_10 = (LPC_IOCON->P3_10 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_10                    0
  #define PINCLR_P3_10                    0
  #define PINDIR_P3_10                    0 // Input

  /* ----- Pin P3[11]: ----- */ 
//LPC_IOCON->P3_11 |= 0; // GPIO
  LPC_IOCON->P3_11 |= 1; // EMC_D11
//LPC_IOCON->P3_11 = (LPC_IOCON->P3_11 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_11                    0
  #define PINCLR_P3_11                    0
  #define PINDIR_P3_11                    0 // Input

  /* ----- Pin P3[12]: ----- */ 
//LPC_IOCON->P3_12 |= 0; // GPIO
  LPC_IOCON->P3_12 |= 1; // EMC_D12
//LPC_IOCON->P3_12 = (LPC_IOCON->P3_12 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_12                    0
  #define PINCLR_P3_12                    0
  #define PINDIR_P3_12                    0 // Input

  /* ----- Pin P3[13]: ----- */ 
//LPC_IOCON->P3_13 |= 0; // GPIO
  LPC_IOCON->P3_13 |= 1; // EMC_D13
//LPC_IOCON->P3_13 = (LPC_IOCON->P3_13 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_13                    0
  #define PINCLR_P3_13                    0
  #define PINDIR_P3_13                    0 // Input

  /* ----- Pin P3[14]: ----- */ 
//LPC_IOCON->P3_14 |= 0; // GPIO
  LPC_IOCON->P3_14 |= 1; // EMC_D14
//LPC_IOCON->P3_14 = (LPC_IOCON->P3_14 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_14                    0
  #define PINCLR_P3_14                    0
  #define PINDIR_P3_14                    0 // Input

