FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVM/IAR/flash_loader NOR/src/LPC1788_pinConfig.h
  /* ----- Pin P3[15]: ----- */ 
//LPC_IOCON->P3_15 |= 0; // GPIO
  LPC_IOCON->P3_15 |= 1; // EMC_D15
//LPC_IOCON->P3_15 = (LPC_IOCON->P3_15 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_15                    0
  #define PINCLR_P3_15                    0
  #define PINDIR_P3_15                    0 // Input

  /* ----- Pin P3[16]: ----- */ 
//LPC_IOCON->P3_16 |= 0; // GPIO
  LPC_IOCON->P3_16 |= 1; // EMC_D16
//LPC_IOCON->P3_16 |= 2; // PWM0_1
//LPC_IOCON->P3_16 |= 3; // U1_TXD
//LPC_IOCON->P3_16 = (LPC_IOCON->P3_16 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_16                    0
  #define PINCLR_P3_16                    0
  #define PINDIR_P3_16                    0 // Input

  /* ----- Pin P3[17]: ----- */ 
//LPC_IOCON->P3_17 |= 0; // GPIO
  LPC_IOCON->P3_17 |= 1; // EMC_D17
//LPC_IOCON->P3_17 |= 2; // PWM0_2
//LPC_IOCON->P3_17 |= 3; // U1_RXD
//LPC_IOCON->P3_17 = (LPC_IOCON->P3_17 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_17                    0
  #define PINCLR_P3_17                    0
  #define PINDIR_P3_17                    0 // Input

  /* ----- Pin P3[18]: ----- */ 
//LPC_IOCON->P3_18 |= 0; // GPIO
  LPC_IOCON->P3_18 |= 1; // EMC_D18
//LPC_IOCON->P3_18 |= 2; // PWM0_3
//LPC_IOCON->P3_18 |= 3; // U1_CTS
//LPC_IOCON->P3_18 = (LPC_IOCON->P3_18 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_18                    0
  #define PINCLR_P3_18                    0
  #define PINDIR_P3_18                    0 // Input

  /* ----- Pin P3[19]: ----- */ 
//LPC_IOCON->P3_19 |= 0; // GPIO
  LPC_IOCON->P3_19 |= 1; // EMC_D19
//LPC_IOCON->P3_19 |= 2; // PWM0_4
//LPC_IOCON->P3_19 |= 3; // U1_DCD
//LPC_IOCON->P3_19 = (LPC_IOCON->P3_19 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_19                    0
  #define PINCLR_P3_19                    0
  #define PINDIR_P3_19                    0 // Input

  /* ----- Pin P3[20]: ----- */ 
//LPC_IOCON->P3_20 |= 0; // GPIO
  LPC_IOCON->P3_20 |= 1; // EMC_D20
//LPC_IOCON->P3_20 |= 2; // PWM0_5
//LPC_IOCON->P3_20 |= 3; // U1_DSR
//LPC_IOCON->P3_20 = (LPC_IOCON->P3_20 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_20                    0
  #define PINCLR_P3_20                    0
  #define PINDIR_P3_20                    0 // Input

  /* ----- Pin P3[21]: ----- */ 
//LPC_IOCON->P3_21 |= 0; // GPIO
  LPC_IOCON->P3_21 |= 1; // EMC_D21
//LPC_IOCON->P3_21 |= 2; // PWM0_6
//LPC_IOCON->P3_21 |= 3; // U1_DTR
//LPC_IOCON->P3_21 = (LPC_IOCON->P3_21 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_21                    0
  #define PINCLR_P3_21                    0
  #define PINDIR_P3_21                    0 // Input

  /* ----- Pin P3[22]: ----- */ 
//LPC_IOCON->P3_22 |= 0; // GPIO
  LPC_IOCON->P3_22 |= 1; // EMC_D22
//LPC_IOCON->P3_22 |= 2; // PWM0_CAP0
//LPC_IOCON->P3_22 |= 3; // U1_RI
//LPC_IOCON->P3_22 = (LPC_IOCON->P3_22 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_22                    0
  #define PINCLR_P3_22                    0
  #define PINDIR_P3_22                    0 // Input

  /* ----- Pin P3[23]: ----- */ 
//LPC_IOCON->P3_23 |= 0; // GPIO
  LPC_IOCON->P3_23 |= 1; // EMC_D23
//LPC_IOCON->P3_23 |= 2; // PWM1_CAP0
//LPC_IOCON->P3_23 |= 3; // T0_CAP0
//LPC_IOCON->P3_23 = (LPC_IOCON->P3_23 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_23                    0
  #define PINCLR_P3_23                    0
  #define PINDIR_P3_23                    0 // Input

  /* ----- Pin P3[24]: ----- */ 
//LPC_IOCON->P3_24 |= 0; // GPIO
  LPC_IOCON->P3_24 |= 1; // EMC_D24
//LPC_IOCON->P3_24 |= 2; // PWM1_1
//LPC_IOCON->P3_24 |= 3; // T0_CAP1
//LPC_IOCON->P3_24 = (LPC_IOCON->P3_24 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_24                    0
  #define PINCLR_P3_24                    0
  #define PINDIR_P3_24                    0 // Input

  /* ----- Pin P3[25]: ----- */ 
//LPC_IOCON->P3_25 |= 0; // GPIO
  LPC_IOCON->P3_25 |= 1; // EMC_D25
//LPC_IOCON->P3_25 |= 2; // PWM1_2
//LPC_IOCON->P3_25 |= 3; // T0_MAT0
//LPC_IOCON->P3_25 = (LPC_IOCON->P3_25 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_25                    0
  #define PINCLR_P3_25                    0
  #define PINDIR_P3_25                    0 // Input

  /* ----- Pin P3[26]: ----- */ 
//LPC_IOCON->P3_26 |= 0; // GPIO
  LPC_IOCON->P3_26 |= 1; // EMC_D26
//LPC_IOCON->P3_26 |= 2; // PWM1_3
//LPC_IOCON->P3_26 |= 3; // T0_MAT1
//LPC_IOCON->P3_26 = (LPC_IOCON->P3_26 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_26                    0
  #define PINCLR_P3_26                    0
  #define PINDIR_P3_26                    0 // Input

  /* ----- Pin P3[27]: ----- */ 
//LPC_IOCON->P3_27 |= 0; // GPIO
  LPC_IOCON->P3_27 |= 1; // EMC_D27
//LPC_IOCON->P3_27 |= 2; // PWM1_4
//LPC_IOCON->P3_27 |= 3; // T1_CAP0
//LPC_IOCON->P3_27 = (LPC_IOCON->P3_27 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_27                    0
  #define PINCLR_P3_27                    0
  #define PINDIR_P3_27                    0 // Input

  /* ----- Pin P3[28]: ----- */ 
//LPC_IOCON->P3_28 |= 0; // GPIO
  LPC_IOCON->P3_28 |= 1; // EMC_D28
//LPC_IOCON->P3_28 |= 2; // PWM1_5
//LPC_IOCON->P3_28 |= 3; // T1_CAP1
//LPC_IOCON->P3_28 = (LPC_IOCON->P3_28 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_28                    0
  #define PINCLR_P3_28                    0
  #define PINDIR_P3_28                    0 // Input

  /* ----- Pin P3[29]: ----- */ 
//LPC_IOCON->P3_29 |= 0; // GPIO
  LPC_IOCON->P3_29 |= 1; // EMC_D29
//LPC_IOCON->P3_29 |= 2; // PWM1_6
//LPC_IOCON->P3_29 |= 3; // T1_MAT0
//LPC_IOCON->P3_29 = (LPC_IOCON->P3_29 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_29                    0
  #define PINCLR_P3_29                    0
  #define PINDIR_P3_29                    0 // Input

  /* ----- Pin P3[30]: ----- */ 
//LPC_IOCON->P3_30 |= 0; // GPIO
  LPC_IOCON->P3_30 |= 1; // EMC_D30
//LPC_IOCON->P3_30 |= 2; // U1_RTS
//LPC_IOCON->P3_30 |= 3; // T1_MAT1
//LPC_IOCON->P3_30 = (LPC_IOCON->P3_30 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_30                    0
  #define PINCLR_P3_30                    0
  #define PINDIR_P3_30                    0 // Input

