FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVM/IAR/flash_loader NOR/src/LPC1788_pinConfig.h
  /* ----- Pin P3[31]: ----- */ 
//LPC_IOCON->P3_31 |= 0; // GPIO
  LPC_IOCON->P3_31 |= 1; // EMC_D31
//LPC_IOCON->P3_31 |= 3; // T1_MAT2
//LPC_IOCON->P3_31 = (LPC_IOCON->P3_31 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P3_31                    0
  #define PINCLR_P3_31                    0
  #define PINDIR_P3_31                    0 // Input



/*---------------------------------------------------------------------------*
 * Port 4 Configuration:
 *---------------------------------------------------------------------------*/
  /* ----- Pin P4[0 ]: ----- */ 
//LPC_IOCON->P4_0  |= 0; // GPIO
  LPC_IOCON->P4_0  |= 1; // EMC_A0
//LPC_IOCON->P4_0  = (LPC_IOCON->P4_0  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_0                     0
  #define PINCLR_P4_0                     0
  #define PINDIR_P4_0                     0 // Input

  /* ----- Pin P4[1 ]: ----- */ 
//LPC_IOCON->P4_1  |= 0; // GPIO
  LPC_IOCON->P4_1  |= 1; // EMC_A1
//LPC_IOCON->P4_1  = (LPC_IOCON->P4_1  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_1                     0
  #define PINCLR_P4_1                     0
  #define PINDIR_P4_1                     0 // Input

  /* ----- Pin P4[2 ]: ----- */ 
//LPC_IOCON->P4_2  |= 0; // GPIO
  LPC_IOCON->P4_2  |= 1; // EMC_A2
//LPC_IOCON->P4_2  = (LPC_IOCON->P4_2  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_2                     0
  #define PINCLR_P4_2                     0
  #define PINDIR_P4_2                     0 // Input

  /* ----- Pin P4[3 ]: ----- */ 
//LPC_IOCON->P4_3  |= 0; // GPIO
  LPC_IOCON->P4_3  |= 1; // EMC_A3
//LPC_IOCON->P4_3  = (LPC_IOCON->P4_3  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_3                     0
  #define PINCLR_P4_3                     0
  #define PINDIR_P4_3                     0 // Input

  /* ----- Pin P4[4 ]: ----- */ 
//LPC_IOCON->P4_4  |= 0; // GPIO
  LPC_IOCON->P4_4  |= 1; // EMC_A4
//LPC_IOCON->P4_4  = (LPC_IOCON->P4_4  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_4                     0
  #define PINCLR_P4_4                     0
  #define PINDIR_P4_4                     0 // Input

  /* ----- Pin P4[5 ]: ----- */ 
//LPC_IOCON->P4_5  |= 0; // GPIO
  LPC_IOCON->P4_5  |= 1; // EMC_A5
//LPC_IOCON->P4_5  = (LPC_IOCON->P4_5  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_5                     0
  #define PINCLR_P4_5                     0
  #define PINDIR_P4_5                     0 // Input

  /* ----- Pin P4[6 ]: ----- */ 
//LPC_IOCON->P4_6  |= 0; // GPIO
  LPC_IOCON->P4_6  |= 1; // EMC_A6
//LPC_IOCON->P4_6  = (LPC_IOCON->P4_6  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_6                     0
  #define PINCLR_P4_6                     0
  #define PINDIR_P4_6                     0 // Input

  /* ----- Pin P4[7 ]: ----- */ 
//LPC_IOCON->P4_7  |= 0; // GPIO
  LPC_IOCON->P4_7  |= 1; // EMC_A7
//LPC_IOCON->P4_7  = (LPC_IOCON->P4_7  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_7                     0
  #define PINCLR_P4_7                     0
  #define PINDIR_P4_7                     0 // Input

  /* ----- Pin P4[8 ]: ----- */ 
//LPC_IOCON->P4_8  |= 0; // GPIO
  LPC_IOCON->P4_8  |= 1; // EMC_A8
//LPC_IOCON->P4_8  = (LPC_IOCON->P4_8  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_8                     0
  #define PINCLR_P4_8                     0
  #define PINDIR_P4_8                     0 // Input

  /* ----- Pin P4[9 ]: ----- */ 
//LPC_IOCON->P4_9  |= 0; // GPIO
  LPC_IOCON->P4_9  |= 1; // EMC_A9
//LPC_IOCON->P4_9  = (LPC_IOCON->P4_9  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_9                     0
  #define PINCLR_P4_9                     0
  #define PINDIR_P4_9                     0 // Input

  /* ----- Pin P4[10]: ----- */ 
//LPC_IOCON->P4_10 |= 0; // GPIO
  LPC_IOCON->P4_10 |= 1; // EMC_A10
//LPC_IOCON->P4_10 = (LPC_IOCON->P4_10 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_10                    0
  #define PINCLR_P4_10                    0
  #define PINDIR_P4_10                    0 // Input

  /* ----- Pin P4[11]: ----- */ 
//LPC_IOCON->P4_11 |= 0; // GPIO
  LPC_IOCON->P4_11 |= 1; // EMC_A11
//LPC_IOCON->P4_11 = (LPC_IOCON->P4_11 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_11                    0
  #define PINCLR_P4_11                    0
  #define PINDIR_P4_11                    0 // Input

  /* ----- Pin P4[12]: ----- */ 
//LPC_IOCON->P4_12 |= 0; // GPIO
  LPC_IOCON->P4_12 |= 1; // EMC_A12
//LPC_IOCON->P4_12 = (LPC_IOCON->P4_12 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_12                    0
  #define PINCLR_P4_12                    0
  #define PINDIR_P4_12                    0 // Input

  /* ----- Pin P4[13]: ----- */ 
//LPC_IOCON->P4_13 |= 0; // GPIO
  LPC_IOCON->P4_13 |= 1; // EMC_A13
//LPC_IOCON->P4_13 = (LPC_IOCON->P4_13 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_13                    0
  #define PINCLR_P4_13                    0
  #define PINDIR_P4_13                    0 // Input

  /* ----- Pin P4[14]: ----- */ 
//LPC_IOCON->P4_14 |= 0; // GPIO
  LPC_IOCON->P4_14 |= 1; // EMC_A14
//LPC_IOCON->P4_14 = (LPC_IOCON->P4_14 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_14                    0
  #define PINCLR_P4_14                    0
  #define PINDIR_P4_14                    0 // Input

  /* ----- Pin P4[15]: ----- */ 
//LPC_IOCON->P4_15 |= 0; // GPIO
  LPC_IOCON->P4_15 |= 1; // EMC_A15
//LPC_IOCON->P4_15 = (LPC_IOCON->P4_15 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_15                    0
  #define PINCLR_P4_15                    0
  #define PINDIR_P4_15                    0 // Input

  /* ----- Pin P4[16]: ----- */ 
//LPC_IOCON->P4_16 |= 0; // GPIO
  LPC_IOCON->P4_16 |= 1; // EMC_A16
//LPC_IOCON->P4_16 = (LPC_IOCON->P4_16 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_16                    0
  #define PINCLR_P4_16                    0
  #define PINDIR_P4_16                    0 // Input

  /* ----- Pin P4[17]: ----- */ 
//LPC_IOCON->P4_17 |= 0; // GPIO
  LPC_IOCON->P4_17 |= 1; // EMC_A17
//LPC_IOCON->P4_17 = (LPC_IOCON->P4_17 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_17                    0
  #define PINCLR_P4_17                    0
  #define PINDIR_P4_17                    0 // Input

