FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVM/IAR/flash_loader NOR/src/LPC1788_pinConfig.h
  /* ----- Pin P4[18]: ----- */ 
//LPC_IOCON->P4_18 |= 0; // GPIO
  LPC_IOCON->P4_18 |= 1; // EMC_A18
//LPC_IOCON->P4_18 = (LPC_IOCON->P4_18 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_18                    0
  #define PINCLR_P4_18                    0
  #define PINDIR_P4_18                    0 // Input

  /* ----- Pin P4[19]: ----- */ 
//LPC_IOCON->P4_19 |= 0; // GPIO
  LPC_IOCON->P4_19 |= 1; // EMC_A19
//LPC_IOCON->P4_19 = (LPC_IOCON->P4_19 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_19                    0
  #define PINCLR_P4_19                    0
  #define PINDIR_P4_19                    0 // Input

  /* ----- Pin P4[20]:A20  ----- */
//LPC_IOCON->P4_20 |= 0; // GPIO
  LPC_IOCON->P4_20 |= 1; // EMC_A20
//LPC_IOCON->P4_20 |= 2; // I2C2_SDA
//    LPC_IOCON->P4_20 = (LPC_IOCON->P4_20 & ~(3<<10)) | (1<<10);
#if HAVE_LOC_REGISTERS
//    LPC_IOCON->LOC_I2C2_SDA = 2;
#endif
  //LPC_IOCON->P4_20 |= 3; // SSP1_SCK
//LPC_IOCON->P4_20 = (LPC_IOCON->P4_20 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_20                    0
  #define PINCLR_P4_20                    0
  #define PINDIR_P4_20                    0 // Input

  /* ----- Pin P4[21]: A21 ----- */
//LPC_IOCON->P4_21 |= 0; // GPIO
  LPC_IOCON->P4_21 |= 1; // EMC_A21
//LPC_IOCON->P4_21 |= 2; // I2C2_SCL
//    LPC_IOCON->P4_21 = (LPC_IOCON->P4_21 & ~(3<<10)) | (1<<10);
#if HAVE_LOC_REGISTERS
//    LPC_IOCON->LOC_I2C2_SCL = 2;
#endif
//LPC_IOCON->P4_21 |= 3; // SSP1_SSEL
//LPC_IOCON->P4_21 = (LPC_IOCON->P4_21 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_21                    0
  #define PINCLR_P4_21                    0
  #define PINDIR_P4_21                    0 // Input

  /* ----- Pin P4[22]: A22 ----- */
//LPC_IOCON->P4_22 |= 0; // GPIO
  LPC_IOCON->P4_22 |= 1; // EMC_A22
//LPC_IOCON->P4_22 |= 2; // U2_TXD
//LPC_IOCON->P4_22 |= 3; // SSP1_MISO
//LPC_IOCON->P4_22 = (LPC_IOCON->P4_22 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P4_22                    0
  #define PINCLR_P4_22                    0
  #define PINDIR_P4_22                    0 // Input

  /* ----- Pin P4[23]: A23 ----- */
//LPC_IOCON->P4_23 |= 0; // GPIO
  LPC_IOCON->P4_23 |= 1; // EMC_A23
//LPC_IOCON->P4_23 |= 2; // U2_RXD
//LPC_IOCON->P4_23 |= 3; // SSP1_MOSI
//LPC_IOCON->P4_23 = (LPC_IOCON->P4_23 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P4_23                    0
  #define PINCLR_P4_23                    0
  #define PINDIR_P4_23                    0 // Input

  /* ----- Pin P4[24]: SDRAM OEn ----- */
//LPC_IOCON->P4_24 |= 0; // GPIO
  LPC_IOCON->P4_24 |= 1; // EMC_OEn
  LPC_IOCON->P4_24 = (LPC_IOCON->P4_24 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_24                    0
  #define PINCLR_P4_24                    0
  #define PINDIR_P4_24                    0 // Input

  /* ----- Pin P4[25]: SDRAM WEn ----- */
//LPC_IOCON->P4_25 |= 0; // GPIO
  LPC_IOCON->P4_25 |= 1; // EMC_WEn
//LPC_IOCON->P4_25 = (LPC_IOCON->P4_25 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_25                    0
  #define PINCLR_P4_25                    0
  #define PINDIR_P4_25                    0 // Input

  /* ----- Pin P4[26]: USB1H_PWRD ----- */
  LPC_IOCON->P4_26 |= 0; // GPIO
//LPC_IOCON->P4_26 |= 1; // EMC_BLS0n
  LPC_IOCON->P4_26 = (LPC_IOCON->P4_26 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_26                    0
  #define PINCLR_P4_26                    0
  #define PINDIR_P4_26                    0 // Input

  /* ----- Pin P4[27]: USB1H_OVC ----- */
  LPC_IOCON->P4_27 |= 0; // GPIO
//LPC_IOCON->P4_27 |= 1; // EMC_BLS1n
  LPC_IOCON->P4_27 = (LPC_IOCON->P4_27 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_27                    0
  #define PINCLR_P4_27                    0
  #define PINDIR_P4_27                    0 // Input

  /* ----- Pin P4[28]: LCDCD[2] ----- */
//LPC_IOCON->P4_28 |= 0; // GPIO
//LPC_IOCON->P4_28 |= 1; // EMC_BLS2n
//LPC_IOCON->P4_28 |= 2; // TXD3
//LPC_IOCON->P4_28 |= 3; // MAT2_0
//LPC_IOCON->P4_28 |= 5; // LCD_VD6
//LPC_IOCON->P4_28 |= 6; // LCD_VD10
  LPC_IOCON->P4_28 |= 7; // LCD_VD2
//LPC_IOCON->P4_28 = (LPC_IOCON->P4_28 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_28                    0
  #define PINCLR_P4_28                    0
  #define PINDIR_P4_28                    0 // Input

  /* ----- Pin P4[29]: LCDVD[3] ----- */
//LPC_IOCON->P4_29 |= 0; // GPIO
//LPC_IOCON->P4_29 |= 1; // EMC_BLS3n
//LPC_IOCON->P4_29 |= 2; // U3_RXD
//LPC_IOCON->P4_29 |= 3; // T2_MAT1
//LPC_IOCON->P4_29 |= 4; // I2C2_SCL
//LPC_IOCON->P4_29 |= 5; // LCD_VD7
//LPC_IOCON->P4_29 |= 6; // LCD_VD11
  LPC_IOCON->P4_29 |= 7; // LCD_VD3
//LPC_IOCON->P4_29 = (LPC_IOCON->P4_29 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_29                    0
  #define PINCLR_P4_29                    0
  #define PINDIR_P4_29                    0 // Input

  /* ----- Pin P4[30]: Flash CS0n ----- */
//LPC_IOCON->P4_30 |= 0; // GPIO
  LPC_IOCON->P4_30 |= 1; // EMC_CS0n
  LPC_IOCON->P4_30 = (LPC_IOCON->P4_30 & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P4_30                    0
  #define PINCLR_P4_30                    0
  #define PINDIR_P4_30                    0 // Input

  /* ----- Pin P4[31]: LCD_RSTn ----- */
  LPC_IOCON->P4_31 |= 0; // GPIO
//LPC_IOCON->P4_31 |= 1; // EMC_CS1n
//  LPC_IOCON->P4_31 = (LPC_IOCON->P4_31 & ~(3<<3)) | (2<<3); // Pull-up
  #define PINSET_P4_31                    1
  #define PINCLR_P4_31                    0
  #define PINDIR_P4_31                    1 // Output



/*---------------------------------------------------------------------------*
 * Port 5 Configuration:
 *---------------------------------------------------------------------------*/
  /* ----- Pin P5[0 ]: ----- */ 
  LPC_IOCON->P5_0  |= 0; // GPIO
//LPC_IOCON->P5_0  |= 1; // EMC_A24
//LPC_IOCON->P5_0  |= 3; // T2_MAT2
  LPC_IOCON->P5_0  = (LPC_IOCON->P5_0  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P5_0                     0
  #define PINCLR_P5_0                     0
  #define PINDIR_P5_0                     0 // Input

  /* ----- Pin P5[1 ]: ----- */ 
  LPC_IOCON->P5_1  |= 0; // GPIO
//LPC_IOCON->P5_1  |= 1; // EMC_A25
//LPC_IOCON->P5_1  |= 3; // T2_MAT3
  LPC_IOCON->P5_1  = (LPC_IOCON->P5_1  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P5_1                     0
  #define PINCLR_P5_1                     0
  #define PINDIR_P5_1                     0 // Input

