FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVM/IAR/flash_loader NOR/src/LPC1788_pinConfig.h
  /* ----- Pin P5[2 ]: ----- */ 
//LPC_IOCON->P5_2  |= 0; // GPIO
//  LPC_IOCON->P5_2  = (LPC_IOCON->P5_2  & ~(3<<3)) | (2<<3); // Pull-up
//LPC_IOCON->P5_2  |= 3; // T3_MAT2
  LPC_IOCON->P5_2  |= 5; // I2C0_SDA
    LPC_IOCON->P5_2  =
            (5<<0)| // FUNC: I2C0_SDA pin mux
            (0<<6)| // INVERT: Not inverted
            (0<<8)| // HS: I2C 50ns glitch filter and slew rate control enabled
            (1<<9); // HIDRIVE: Output drive sink is 20 mA for Fast Mode Plus

  #define PINSET_P5_2                     0
  #define PINCLR_P5_2                     0
  #define PINDIR_P5_2                     0 // Input

  /* ----- Pin P5[3 ]: ----- */ 
//LPC_IOCON->P5_3  |= 0; // GPIO
//  LPC_IOCON->P5_3  = (LPC_IOCON->P5_3  & ~(3<<3)) | (2<<3); // Pull-up
//LPC_IOCON->P5_3  |= 4; // U4_RXD
  LPC_IOCON->P5_3  |= 5; // I2C0_SCL
      LPC_IOCON->P5_3  =
              (5<<0)| // FUNC: I2C0_SCL pin mux
              (0<<6)| // INVERT: Not inverted
              (0<<8)| // HS: I2C 50ns glitch filter and slew rate control enabled
              (1<<9); // HIDRIVE: Output drive sink is 20 mA for Fast Mode Plus
  #define PINSET_P5_3                     0
  #define PINCLR_P5_3                     0
  #define PINDIR_P5_3                     0 // Input

  /* ----- Pin P5[4 ]: ----- */ 
  LPC_IOCON->P5_4  |= 0; // GPIO
//LPC_IOCON->P5_4  |= 1; // U0_OE
//LPC_IOCON->P5_4  |= 3; // T3_MAT3
//LPC_IOCON->P5_4  |= 4; // U4_TXD
  LPC_IOCON->P5_4  = (LPC_IOCON->P5_4  & ~(3<<3)) | (2<<3); // Pull-up 
  #define PINSET_P5_4                     0
  #define PINCLR_P5_4                     0
  #define PINDIR_P5_4                     0 // Input

  /* ----- Pin P5[5 ]: Not used ----- */ 
  #define PINSET_P5_5                     0
  #define PINCLR_P5_5                     0
  #define PINDIR_P5_5                     0 // Input

  /* ----- Pin P5[6 ]: Not used ----- */ 
  #define PINSET_P5_6                     0
  #define PINCLR_P5_6                     0
  #define PINDIR_P5_6                     0 // Input

  /* ----- Pin P5[7 ]: Not used ----- */ 
  #define PINSET_P5_7                     0
  #define PINCLR_P5_7                     0
  #define PINDIR_P5_7                     0 // Input

  /* ----- Pin P5[8 ]: Not used ----- */ 
  #define PINSET_P5_8                     0
  #define PINCLR_P5_8                     0
  #define PINDIR_P5_8                     0 // Input

  /* ----- Pin P5[9 ]: Not used ----- */ 
  #define PINSET_P5_9                     0
  #define PINCLR_P5_9                     0
  #define PINDIR_P5_9                     0 // Input

  /* ----- Pin P5[10]: Not used ----- */ 
  #define PINSET_P5_10                    0
  #define PINCLR_P5_10                    0
  #define PINDIR_P5_10                    0 // Input

  /* ----- Pin P5[11]: Not used ----- */ 
  #define PINSET_P5_11                    0
  #define PINCLR_P5_11                    0
  #define PINDIR_P5_11                    0 // Input

  /* ----- Pin P5[12]: Not used ----- */ 
  #define PINSET_P5_12                    0
  #define PINCLR_P5_12                    0
  #define PINDIR_P5_12                    0 // Input

  /* ----- Pin P5[13]: Not used ----- */ 
  #define PINSET_P5_13                    0
  #define PINCLR_P5_13                    0
  #define PINDIR_P5_13                    0 // Input

  /* ----- Pin P5[14]: Not used ----- */ 
  #define PINSET_P5_14                    0
  #define PINCLR_P5_14                    0
  #define PINDIR_P5_14                    0 // Input

  /* ----- Pin P5[15]: Not used ----- */ 
  #define PINSET_P5_15                    0
  #define PINCLR_P5_15                    0
  #define PINDIR_P5_15                    0 // Input

  /* ----- Pin P5[16]: Not used ----- */ 
  #define PINSET_P5_16                    0
  #define PINCLR_P5_16                    0
  #define PINDIR_P5_16                    0 // Input

  /* ----- Pin P5[17]: Not used ----- */ 
  #define PINSET_P5_17                    0
  #define PINCLR_P5_17                    0
  #define PINDIR_P5_17                    0 // Input

  /* ----- Pin P5[18]: Not used ----- */ 
  #define PINSET_P5_18                    0
  #define PINCLR_P5_18                    0
  #define PINDIR_P5_18                    0 // Input

  /* ----- Pin P5[19]: Not used ----- */ 
  #define PINSET_P5_19                    0
  #define PINCLR_P5_19                    0
  #define PINDIR_P5_19                    0 // Input

  /* ----- Pin P5[20]: Not used ----- */ 
  #define PINSET_P5_20                    0
  #define PINCLR_P5_20                    0
  #define PINDIR_P5_20                    0 // Input

  /* ----- Pin P5[21]: Not used ----- */ 
  #define PINSET_P5_21                    0
  #define PINCLR_P5_21                    0
  #define PINDIR_P5_21                    0 // Input

  /* ----- Pin P5[22]: Not used ----- */ 
  #define PINSET_P5_22                    0
  #define PINCLR_P5_22                    0
  #define PINDIR_P5_22                    0 // Input

  /* ----- Pin P5[23]: Not used ----- */ 
  #define PINSET_P5_23                    0
  #define PINCLR_P5_23                    0
  #define PINDIR_P5_23                    0 // Input

  /* ----- Pin P5[24]: Not used ----- */ 
  #define PINSET_P5_24                    0
  #define PINCLR_P5_24                    0
  #define PINDIR_P5_24                    0 // Input

  /* ----- Pin P5[25]: Not used ----- */ 
  #define PINSET_P5_25                    0
  #define PINCLR_P5_25                    0
  #define PINDIR_P5_25                    0 // Input

  /* ----- Pin P5[26]: Not used ----- */ 
  #define PINSET_P5_26                    0
  #define PINCLR_P5_26                    0
  #define PINDIR_P5_26                    0 // Input

  /* ----- Pin P5[27]: Not used ----- */ 
  #define PINSET_P5_27                    0
  #define PINCLR_P5_27                    0
  #define PINDIR_P5_27                    0 // Input

  /* ----- Pin P5[28]: Not used ----- */ 
  #define PINSET_P5_28                    0
  #define PINCLR_P5_28                    0
  #define PINDIR_P5_28                    0 // Input

  /* ----- Pin P5[29]: Not used ----- */ 
  #define PINSET_P5_29                    0
  #define PINCLR_P5_29                    0
  #define PINDIR_P5_29                    0 // Input

  /* ----- Pin P5[30]: Not used ----- */ 
  #define PINSET_P5_30                    0
  #define PINCLR_P5_30                    0
  #define PINDIR_P5_30                    0 // Input

  /* ----- Pin P5[31]: Not used ----- */ 
  #define PINSET_P5_31                    0
  #define PINCLR_P5_31                    0
  #define PINDIR_P5_31                    0 // Input

